// // **************************************  JS Function  ************************************** 
// // **************************************  Function zohioh ************************************** 
/*
1. Өгөгдсөн 2 тооны ихийг олох функц бич.
2. Өгөгдсөн array -аас өгөгдсөн тоо байгаа эсэхийг олох функц бич. Тухайн тоо байвал индексийг буцаана. Байхгүй бол -1 буцаана.
3. Өгөгдсөн тэмдэгт мөрөөс -аас өгөгдсөн тэмдэгт байгаа эсэхийг олох функц бич. Тухайн тэмдэгт байвал индексийг буцаана. Байхгүй бол -1 буцаана.
4. Өгөгдсөн 2 тоон интервал дахь санамсаргүй тоо буцаах функц бич.
5. Өгөгдсөн array - ийн дундажыг олох функц бич.
6. Өгөгдсөн array - ийн нийлбэрийг олох функц бич.
7. Өгөгдсөн тоо анхны эсэхийг олох функц бич.

*/


// 1. Өгөгдсөн 2 тооны ихийг олох функц бич.

let num1 = Number(prompt("Insert number 1"));
let num2 = Number(prompt("Insert number 2"));

function findMax(x, y) {
    if(x < y) {
        console.log(y + ' is bigger than ' + x);
    } else if (x > y) {
        console.log(x + ' is bigger than ' + y);
    } else {
        console.log(y + ' = ' + x);
    }
}

findMax(num1, num2)



// 2. Өгөгдсөн array -аас өгөгдсөн тоо байгаа эсэхийг олох функц бич. Тухайн тоо байвал индексийг буцаана. Байхгүй бол -1 буцаана.
