// // **************************************  JS Number exercise - 6 ************************************** 
// // **************************************  Validate phone number ************************************** 
/*
Хэрвээ хэрэглэгч гараас утасны дугаар оруулвал өгөгдсөн утгыг тоо мөн эсвэл биш эсэхийг шалгаарай.
Дараа нь тухайн өгөгдсөн утасны эхний 4 орон нь +976 байгаа эсэхийг шалгана. 
Эцэст нь өгөгдсөн утасны дугаарын урт 12 байвал та монгол улсын утасны дугаарыг зөв орууллаа гэж харуулаарай. 
Хэрвээ буруу байвал та монгол улсын утасны дугаарыг буруу орууллаа гэж харуулна.
Жишээ нь
Input: +97699119911

*/


let mobile  = prompt("Монгол улсын утасны дугаарыг оруулна уу. Жич: +976..... гэсэн байдлаар бичнэ үү.");
console.log("Оруулсан утасны дугаар: " + mobile);
let hasPlus = (mobile.substr(0,1)=="+");     //Boolean 
let countryCode = (mobile.substr(1,3));  
let number = mobile.substr(4,8);
// console.log(number);
// console.log(countryCode);


if( hasPlus && countryCode == "976" && mobile.length == 12 && Number.isInteger(Number(mobile)) ) {
    // console.log(mobile.substr(0,1));
    console.log("Баяр хүргэе. \nТа Монгол улсын утасны дугаарыг улсын кодтой хамт зөв оруулсан байна.");
}
else {
     console.error("Та Монгол улсын утасны дугаарыг буруу оруулсан байна.");

    if(mobile.length != 12) {
        console.error("утасны дугаар илүү эсвэл дутуу оронтой байна.");
    }

    if(!hasPlus) {
        console.error("+ тэмдэг дутуу байна");
    }
    
    if (hasPlus && countryCode != 976) {
        console.error("Улсын код буруу");
    }
}