// // **************************************  JS Number exercise - 4 ************************************** 
// // **************************************  General-Triangle ************************************** 
/*
Тэгш өнцөгт гурвалжны 2 суурын урт өгөгдсөн(a, b) бол тухайн гурвалжины налуугын уртыг( c ) ол
*/

let side1 = Number(prompt("Тэгш өнцөгт Гурвалжны А тал оруулна уу ."));
let side2 = Number(prompt("Тэгш өнцөгт Гурвалжны B тал оруулна уу."));

if(isNaN(side1) || isNaN(side2)) {
    console.error("Алдаа. Зөвхөн тоо оруулна уу.")
}
else {
    console.log("Тэгш өнцөгт Гурвалжны А тал : " + side1);
    console.log("Тэгш өнцөгт Гурвалжны B тал : " + side2);
    
    let side3 = Math.sqrt(Math.pow(side1,2) + Math.pow(side2,2))
    
    console.log("Тэгш өнцөгт Гурвалжны урт C тал  /c2 = a2 + b2/: " + side3);
}