// // // **************************************  JS Number exercise - 2 ************************************** 
// // // **************************************  Numbers Sum ************************************** 
/*
3 оронтой той ( n ) ороход тухайн 3 оронтой тооны цифрүүдийн нийлбэрийг ол.
*/

let input = prompt("Тоо оруулна уу.")
console.log("Оруулсан тоо : " + input);

sum = 0;
let i = 0; 

while (i < input.length) {
    sum += Number(input.charAt(i));
    i++;
}

if(isNaN(sum)) {
    console.error("Алдаа гарлаа. Үсэг оруулсан байна.");
}
else {
    console.log("Ципрүүдийн нийлбэр : " + sum);
}